# how to create series

In [1]:
import numpy as np
import pandas as pd
#through list
my_list = [2,3,4]
pd.Series(my_list)

0    2
1    3
2    4
dtype: int64

In [2]:
#through numpy
np.array(my_list)

array([2, 3, 4])

In [3]:
pd.Series(np.array(my_list))

0    2
1    3
2    4
dtype: int64

In [4]:
#through dictionary
dict={'a':2,'b':4,'c':6}
pd.Series(dict)

a    2
b    4
c    6
dtype: int64

# assesing element in series

In [5]:
ser=pd.Series(['p','y','t','h','o','n'])
ser

0    p
1    y
2    t
3    h
4    o
5    n
dtype: object

In [6]:
ser[4]

'o'

In [7]:
ser[4:6]

4    o
5    n
dtype: object

# Mathematical operation on series

In [8]:
ser1=pd.Series([2,3,4,5],index=['usa','japan','ussr','germany'])
ser1

usa        2
japan      3
ussr       4
germany    5
dtype: int64

In [9]:
ser2=pd.Series([2,3,6,8],index=['usa','japan','italy','germany'])
ser2

usa        2
japan      3
italy      6
germany    8
dtype: int64

In [10]:
ser3=ser1+ser2
ser3

germany    13.0
italy       NaN
japan       6.0
usa         4.0
ussr        NaN
dtype: float64

In [11]:
ser2*2

usa         4
japan       6
italy      12
germany    16
dtype: int64

In [12]:
ser2.dtype

dtype('int64')

In [13]:
ser1/ser2

germany    0.625
italy        NaN
japan      1.000
usa        1.000
ussr         NaN
dtype: float64

In [14]:
ser1['usa':'ussr']

usa      2
japan    3
ussr     4
dtype: int64

In [15]:
ser1[0:3]

usa      2
japan    3
ussr     4
dtype: int64

In [16]:
ser1[ser1<4]

usa      2
japan    3
dtype: int64

In [17]:
ser1.max()

5

In [18]:
ser1.argmax()

3

In [19]:
ser1[ser1!=4]

usa        2
japan      3
germany    5
dtype: int64

# dataframe

In [20]:
df=pd.DataFrame(np.random.rand(4,4))
df

          0         1         2         3
0  0.731733  0.627896  0.573368  0.322248
1  0.404588  0.254588  0.232949  0.603198
2  0.020459  0.775014  0.892225  0.805348
3  0.211286  0.387791  0.760014  0.418879

In [21]:
df1=pd.DataFrame(np.random.rand(4,4),index=['a','b','c','d'],columns=['w','x','y','z'])
df1

          w         x         y         z
a  0.830074  0.259113  0.984445  0.132064
b  0.813848  0.531683  0.415542  0.712106
c  0.698425  0.581486  0.807222  0.634122
d  0.033154  0.632091  0.698791  0.550153

In [22]:
#how to rename the columns
df1.rename(columns={'w':'AW'},inplace=True)
df1

         AW         x         y         z
a  0.830074  0.259113  0.984445  0.132064
b  0.813848  0.531683  0.415542  0.712106
c  0.698425  0.581486  0.807222  0.634122
d  0.033154  0.632091  0.698791  0.550153

In [23]:
#how to access columns element
df1[['AW','x']]

         AW         x
a  0.830074  0.259113
b  0.813848  0.531683
c  0.698425  0.581486
d  0.033154  0.632091

In [24]:
df1['new']=df1['AW']+df1['x']
df1

         AW         x         y         z       new
a  0.830074  0.259113  0.984445  0.132064  1.089188
b  0.813848  0.531683  0.415542  0.712106  1.345532
c  0.698425  0.581486  0.807222  0.634122  1.279911
d  0.033154  0.632091  0.698791  0.550153  0.665245

In [25]:
df1.drop(columns=['new'],axis=1,inplace=True)
df1

         AW         x         y         z
a  0.830074  0.259113  0.984445  0.132064
b  0.813848  0.531683  0.415542  0.712106
c  0.698425  0.581486  0.807222  0.634122
d  0.033154  0.632091  0.698791  0.550153

In [26]:
df1.columns

Index(['AW', 'x', 'y', 'z'], dtype='object')

In [27]:
df4=pd.DataFrame(
{
    'A':[1,2,np.nan],
    'B':[np.nan,4,np.nan],
    'C':[2,4,5]
}
)
df4

     A    B  C
0  1.0  NaN  2
1  2.0  4.0  4
2  NaN  NaN  5

In [28]:
df4.dropna()  #remove the rows if it ll have atleast one missing value

     A    B  C
1  2.0  4.0  4

In [29]:
df4.dropna(axis=1)  #remove the coluns if it ll have atleast one missing value

   C
0  2
1  4
2  5

In [30]:
df4.fillna('fill')

      A     B  C
0   1.0  fill  2
1   2.0   4.0  4
2  fill  fill  5

In [31]:
df5=df4.fillna(df4.mean())
df5

     A    B  C
0  1.0  4.0  2
1  2.0  4.0  4
2  1.5  4.0  5

df6=df4.fillna(value=df4.median())

In [32]:
df6=df4.fillna(value=df4.median())
df6

     A    B  C
0  1.0  4.0  2
1  2.0  4.0  4
2  1.5  4.0  5

In [33]:
#loc and iloc in pandas
#access elements in DATAFRAME
df1=pd.DataFrame(np.random.rand(4,4),index=['a','b','c','d'],columns=['w','x','y','z'])
df1

          w         x         y         z
a  0.522141  0.382607  0.677250  0.187640
b  0.006925  0.410626  0.071737  0.384712
c  0.639500  0.276085  0.173870  0.351614
d  0.463565  0.717163  0.557666  0.009555

In [34]:
df1.loc['d','x']

0.7171628626069483

In [35]:
df1.loc[['b','d'],['x','z']]

          x         z
b  0.410626  0.384712
d  0.717163  0.009555

#row b and c  column x:z
df1.loc['b']

In [36]:
##row b and c  column x:z
df1.loc[['b','c'],'x':'z']

          x         y         z
b  0.410626  0.071737  0.384712
c  0.276085  0.173870  0.351614

In [37]:
df1.iloc[[1,2],1:4]

          x         y         z
b  0.410626  0.071737  0.384712
c  0.276085  0.173870  0.351614

In [38]:
import os
os.getcwd()

'/Users/sibu'

In [44]:
df.to_csv('df.csv', index= False)

In [43]:
df.to_csv(r'/Users/sibu'/pandas/test123.csv', index= False)

SyntaxError: EOL while scanning string literal (2175923716.py, line 1)

In [49]:
df8=pd.concat([df,df1])
df8

,0,1,2,3,w,x,y,z
0,0.731733,0.627896,0.573368,0.322248,NaN,NaN,NaN,NaN
1,0.404588,0.254588,0.232949,0.603198,NaN,NaN,NaN,NaN
2,0.020459,0.775014,0.892225,0.805348,NaN,NaN,NaN,NaN
3,0.211286,0.387791,0.760014,0.418879,NaN,NaN,NaN,NaN
a,NaN,NaN,NaN,NaN,0.522141,0.382607,0.677250,0.187640
b,NaN,NaN,NaN,NaN,0.006925,0.410626,0.071737,0.384712
c,NaN,NaN,NaN,NaN,0.639500,0.276085,0.173870,0.351614
d,NaN,NaN,NaN,NaN,0.463565,0.717163,0.557666,0.009555

In [52]:
df8.reset_index()

,index,0,1,2,3,w,x,y,z
0,0,0.731733,0.627896,0.573368,0.322248,NaN,NaN,NaN,NaN
1,1,0.404588,0.254588,0.232949,0.603198,NaN,NaN,NaN,NaN
2,2,0.020459,0.775014,0.892225,0.805348,NaN,NaN,NaN,NaN
3,3,0.211286,0.387791,0.760014,0.418879,NaN,NaN,NaN,NaN
4,a,NaN,NaN,NaN,NaN,0.522141,0.382607,0.677250,0.187640
5,b,NaN,NaN,NaN,NaN,0.006925,0.410626,0.071737,0.384712
6,c,NaN,NaN,NaN,NaN,0.639500,0.276085,0.173870,0.351614
7,d,NaN,NaN,NaN,NaN,0.463565,0.717163,0.557666,0.009555

In [45]:
df.describe()

              0         1         2         3
count  4.000000  4.000000  4.000000  4.000000
mean   0.342017  0.511323  0.614639  0.537419
std    0.303471  0.234019  0.286111  0.213278
min    0.020459  0.254588  0.232949  0.322248
25%    0.163580  0.354490  0.488263  0.394722
50%    0.307937  0.507844  0.666691  0.511039
75%    0.486374  0.664676  0.793067  0.653736
max    0.731733  0.775014  0.892225  0.805348

In [46]:
df.head(2)

          0         1         2         3
0  0.731733  0.627896  0.573368  0.322248
1  0.404588  0.254588  0.232949  0.603198

In [47]:
df.tail(3)

          0         1         2         3
1  0.404588  0.254588  0.232949  0.603198
2  0.020459  0.775014  0.892225  0.805348
3  0.211286  0.387791  0.760014  0.418879

In [48]:
df4=pd.DataFrame(
{
    'A':[1,2,np.nan],
    'B':[np.nan,4,np.nan],
    'C':[2,4,5]
}
)
df4

     A    B  C
0  1.0  NaN  2
1  2.0  4.0  4
2  NaN  NaN  5

In [58]:
df4.isnull()

       A      B      C
0  False   True  False
1  False  False  False
2   True   True  False

In [59]:
df4.notnull()

       A      B     C
0   True  False  True
1   True   True  True
2  False  False  True

In [60]:
df4.mean()

A    1.500000
B    4.000000
C    3.666667
dtype: float64

In [62]:
df4.fillna(df4.mean())

     A    B  C
0  1.0  4.0  2
1  2.0  4.0  4
2  1.5  4.0  5

In [63]:
df4.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       2 non-null      float64
 1   B       1 non-null      float64
 2   C       3 non-null      int64
dtypes: float64(2), int64(1)
memory usage: 200.0 bytes

In [64]:
df4.drop_duplicates()

     A    B  C
0  1.0  NaN  2
1  2.0  4.0  4
2  NaN  NaN  5

In [1]:
import pandas as pd
pd.read_csv('/Users/sibu/Desktop/people.csv')

,satisfactoryLevel,lastEvaluation,numberOfProjects,avgMonthlyHours,timeSpent.company,workAccident,left,promotionInLast5years,dept,salary
0,0.38,0.53,2,157,3,0,1,0,sales,low
1,0.80,0.86,5,262,6,0,1,0,sales,medium
2,0.11,0.88,7,272,4,0,1,0,sales,medium
3,0.37,0.52,2,159,3,0,1,0,sales,low
4,0.41,0.50,2,153,3,0,1,0,sales,low
...,...,...,...,...,...,...,...,...,...,...
14994,0.11,0.85,7,275,4,0,1,0,support,medium
14995,0.99,0.83,4,274,2,0,0,0,sales,low
14996,0.72,0.72,4,175,4,0,0,0,technical,low
14997,0.24,0.91,5,177,5,0,0,0,sales,low
14998,0.77,0.83,6,271,3,0,0,0,support,low